example_1 = "人工智能正在逐渐改变我们的生活。从智能手机助手到自动驾驶汽车，AI技术的应用无处不在。它不仅提高了工作效率，还为我们带来了前所未有的便利。然而，随着技术的进步，我们也面临着伦理和隐私的挑战。如何平衡利益与风险，是我们必须深入思考的问题。"
tag_list1 = "[\"人工智能\",\"技术应用\",\"医疗\",\"伦理\",\"游戏\",\"隐私\",\"大数据科学\",\"军事\",\"交易\"]"
ans_tag1 = "[\"人工智能\",\"技术应用\",\"伦理\",\"隐私\"]"
ans_tag1_limit = "[\"人工智能\",\"技术应用\",\"伦理\"]"
to_score_tag1 = "[\"人工智能\",\"技术应用\",\"医疗\",\"伦理\",\"游戏\",\"隐私\",\"军事\",\"交易\"]"
score_list1 = "{'人工智能':99, '技术应用':98, '医疗':27, '伦理':90, '游戏':16, '隐私':93, '军事':28, '交易':27 }"
modified_tag_list1 = "[\"娱乐\",\"军事\",\"体育\",\"历史\",\"健康\",\"历史\",\"科技\",\"文化\",\"教育\",\"游戏\",\"生活\"]"
modified_tag_ans1 = "[\"科技\"]"

example_2 = "咖啡不仅是全球最受欢迎的饮品之一，也是一种文化象征。它的种类繁多，从浓郁的意式浓缩到轻柔的拿铁。每种咖啡都有其独特的风味和冲泡方法。咖啡文化在世界各地不断演变，从传统的咖啡馆到现代的快速咖啡连锁店，它不仅仅是一种饮品，更是一种生活方式的体现。"
tag_list2 = "[\"可乐\",\"咖啡\",\"饮品\",\"音频\",\"旅游\",\"咖啡文化演变\",\"大航海时代\",\"盐湖城\",\"生活方式表达\",\"百慕大\"]"
# tag_list2 = "[\"葡萄酒鉴赏\",\"意式烹饪法\",\"咖啡\",\"饮品文化\",\"快餐文化\",\"咖啡多样性\",\"高科技产品\",\"拿铁\",\"咖啡馆\",\"传统饮食\",\"艺术表现\"]"
ans_tag2 = "[\"咖啡\",\"饮品\",\"咖啡文化演变\",\"生活方式表达\"]"
# ans_tag2 = "[\"咖啡\",\"饮品文化\",\"咖啡多样性\",\"拿铁\",\"咖啡馆\"]"
ans_tag2_limit = "[\"咖啡\",\"咖啡文化演变\",\"生活方式表达\"]"
to_score_tag2 = "[\"可乐\",\"咖啡\",\"饮品\",\"音频\",\"旅游\",\"文化象征\",\"大航海时代\",\"盐湖城\",\"生活方式\",\"百慕大\"]"
score_list2 = "{'可乐':21, '咖啡':99, '饮品':90, '音频':13, '旅游':12, '文化象征':76, '大航海时代':18, '盐湖城':14, '生活方式':88, '百慕大':19}"
modified_tag_list2 = "[\"娱乐\",\"军事\",\"体育\",\"历史\",\"健康\",\"历史\",\"科技\",\"文化\",\"教育\",\"游戏\",\"生活\"]"
modified_tag_ans2 = "[\"文化\",\"生活\"]"

example_3 = "古埃及文明是人类历史上最辉煌的文明之一，以其金字塔、木乃伊和象形文字闻名于世。这个文明沿尼罗河发展，持续了近三千年。古埃及人对天文学、数学和建筑学有着深刻的理解和贡献。金字塔不仅是古埃及王权的象征，也展示了古埃及人惊人的工程技术和艺术成就。此外，法老和神话故事也是研究古埃及文明不可或缺的一部分。"
tag_list3 = "[\"古埃及文明\",\"虚拟现实\",\"现代生活\",\"金字塔\",\"木乃伊\",\"霸王龙\",\"翼龙\",\"古代科技与工程\",\"幼发拉底河\",\"法老\",\"人机交互\",\"尼罗河\",\"历史遗产\", \"恒河文明\"]"
# tag_list3 = "[\"古埃及文明\",\"现代科技\",\"中世纪欧洲\",\"古代工程奇迹\",\"工业革命\",\"尼罗河\",\"动力学\",\"数字时代\",\"文明史\",\"古代科学贡献\",\"海洋探索\",\"象形文字\",\"现代金字塔理论\",\"古代传说合集\",\"木乃伊\"]"
ans_tag3 = "[\"古埃及文明\",\"金字塔\",\"木乃伊\",\"历史遗产\",\"古代科技与工程\",\"法老\",\"尼罗河\"]"
# ans_tag3 = "[\"古埃及文明\",\"古代工程奇迹\",\"尼罗河\",\"文明史\",\"古代科学贡献\",\"象形文字\",\"木乃伊\"]"
ans_tag3_limit = "[\"古埃及文明\",\"历史遗产\",\"古代科技与工程\"]"

to_score_tag3 = "[\"古埃及文明\",\"虚拟现实\",\"现代生活\",\"金字塔\",\"木乃伊\",\"霸王龙\",\"翼龙\",\"象形文字\",\"幼发拉底河\",\"法老\",\"人机交互\",\"尼罗河\"]"
score_list3 = "{'古埃及文明':99, '虚拟现实':11, '现代生活':12, '金字塔':98, '木乃伊':95, '霸王龙':15, '翼龙':3, '象形文字':89, '幼发拉底河':12, '法老':93, '人机交互':13, '尼罗河':91}"
modified_tag_list3 = "[\"娱乐\",\"军事\",\"体育\",\"历史\",\"健康\",\"历史\",\"科技\",\"文化\",\"教育\",\"游戏\",\"生活\"]"
modified_tag_ans3 = "[\"历史\",\"文化\",\"科技\"]"

for_score_example1 = "在一个寒冷的冬夜，一位老人坐在温暖的火炉旁，回忆着他年轻时的冒险故事。他的眼睛在微弱的火光中闪烁着智慧和怀旧之情。外面，风雪交加，但在他心中，回忆如同夏日的阳光一般温暖。尽管岁月已经改变了他的外表，但他坚强的意志和勇敢的心灵依旧未变。他的故事充满了挑战、勇气和爱情的主题，激励着聆听的孙子要勇敢面对生活的困难。"
for_score_tags1 = "[\"智慧\", \"科技\", \"冒险\", \"怀旧\", \"运动\", \"勇敢\", \"传承\", \"坚韧\", \"音乐\", \"挑战\", \"沉思\", \"激励\"]"
for_score_dict1 = "{'智慧': 82, '科技': 18, '冒险': 74, '怀旧': 89, '运动': 27, '勇敢': 81, '传承': 84, '坚韧': 83, '音乐': 34, '挑战': 69, '沉思': 53, '激励': 66}"

for_score_example2 = "泰山位于中国山东省，是中国著名的五岳之首。泰山的山势雄伟，历史悠久，自古就有“泰山安天下”之说。泰山不仅是自然风光的宝库，更是文化遗产的聚集地。山上有着众多的人文景观，如碑刻和寺庙，它们见证了中国几千年的历史变迁。泰山之巅的日出景象尤为壮观，吸引了无数登山者前来观赏。此外，泰山的自然风光独特，有众多珍稀植物和动物，是一个自然和人文交融的美丽地方。"
for_score_tags2 = "[\"文化遗产\", \"挑战\", \"日出\", \"人文景观\", \"泰山\", \"自然风光\", \"历史\", \"旅游\", \"冒险\", \"科技\", \"宁静\"]"
for_score_dict2 = "{'文化遗产': 84, '日出': 70, '自然风光': 85, '旅游': 74, '宁静': 59, '泰山': 97, '历史': 53, '挑战': 48, '科技': 31,  '人文景观': 80, '时政': 11}"

for_score_example3 = "在当今社会，科技与日常生活的联系日益紧密。科技的发展不仅极大地改变了人们的生活方式，也推动了经济的快速发展。例如，智能手机和互联网的普及使人们的沟通更为便捷，信息获取更加迅速。同时，新技术的出现也带来了新的挑战，比如网络安全问题和隐私保护。此外，科技进步对环境的影响也不容忽视，它既带来了清洁能源的利用，也引发了一些环境问题。因此，我们需要在享受科技带来的便利的同时，也要关注其可能产生的负面影响。"
for_score_tags3 = "[\"全球化\", \"双刃剑\", \"网络安全\", \"社会变革\", \"环境影响\", \"可持续性\", \"经济发展\", \"机遇和挑战\", \"人工智能\", \"创新\", \"数据隐私\"]"
for_score_dict3 = "{'机遇和挑战': 90, '双刃剑': 85, '经济发展': 75, '网络安全': 71, '环境影响': 65, '创新': 58, '社会变革': 53, '数据隐私': 51, '可持续性': 43, '全球化': 41, '人工智能': 31}"

req1 = "请你用中文完成给文本打tag的任务，具体如下：你的输入是给定的tag列表和一段文本，这两者用分号隔开。请你只从给定的tag列表中选择适合这段文本的tag，以列表方式输出。"
req2 = "请你用中文完成给文本打tag的任务，具体如下：你的输入是给定的一段文本。请你总结适合这段文本的tag，以列表方式输出。"
req3 = "请你对给定的文本，用简短的语句概括其主要内容，不需要进行解释："
req4 = "根据以下内容，为我提取3个中文关键词："
req5 = "请根据以下内容，为我提取中文关键词："
req6 = "请你用中文完成给文本打3个tag的任务，具体如下：你的输入是给定的一段文本。请你总结适合这段文本的3个tag，以列表方式输出。"
req7 = "请你用中文完成给文本打tag的任务，具体如下：你的输入是给定的一段文本。请你总结适合这段文本的一个tag，以[\"xx\"]的形式输出。"
req8 = "请你完成根据文本内容给指定词语打分的任务。具体如下：你的输入是文本和待评分的词语列表，你需要对待评分的每个词语，根据他们和文本内容的相关度打分，然后以json格式输出。请注意，你要给所有的待评分词语打分"


def get_choosing_prompt_zero_shot(input_text, input_list):
    print(input_list)
    return f"{req7}"\
           f"{input_text};{input_list}\n"


def get_choosing_prompt(input_text, input_list):
    print(input_list)
    return f"{req1}" \
           "请你参照以下的例子进行输入输出：\n" \
           f"输入：{example_1};{modified_tag_list1}\n" \
           f"输出：{modified_tag_ans1}\n" \
           f"输入：{example_2};{modified_tag_list2}\n" \
           f"输出：{modified_tag_ans2}\n" \
           f"输入：{example_3};{modified_tag_list3}\n" \
           f"输出：{modified_tag_ans3}\n" \
           f"接下来轮到你\n" \
           f"输入：{input_text};{input_list}\n" \
           f"输出："


def get_summarize_words_prompt(input_text):
    return f"{req2}" \
          "请你参照以下的例子进行输入输出：\n" \
          f"输入：{example_1}\n" \
          f"输出：{ans_tag1}\n" \
          f"输入：{example_2}\n" \
          f"输出：{ans_tag2}\n" \
          f"输入：{example_3}\n" \
          f"输出：{ans_tag3}\n" \
          f"接下来轮到你\n" \
          f"输入：{input_text}\n" \
          f"输出："


def get_summarize_words_prompt_zero_shot(input_text):
    return f"{req5}" \
           f"{input_text}\n" \
           f"请以列表的形式给出关键词,形如[\"xx\",\"xx\",\"xx\"]"
           

def get_summarize_words_prompt_limit(input_text):
    return f"{req6}" \
           f"请参照以下的例子进行输入输出，每个输出结果都是一个大小为3的列表：\n" \
           f"输入：{example_1}\n" \
           f"输出：{ans_tag1_limit}\n" \
           f"输入：{example_2}\n" \
           f"输出：{ans_tag2_limit}\n" \
           f"输入：{example_3}\n" \
           f"输出：{ans_tag3_limit}\n" \
           f"接下来轮到你\n" \
           f"输入：{input_text}\n" \
           f"输出："
          

def get_summarize_article_prompt(input_text):
    return f"{req3}\n" \
           f"{input_text}"


def get_words_score_prompt(input_text, input_list):
    return f"{req8}\n" \
           f"请参照以下给出的例子进行输入输出：\n" \
           f"输入文本：{for_score_example1}\n" \
           f"输入列表：{for_score_tags1}\n" \
           f"输出：{for_score_dict1}\n" \
           f"输入文本：{for_score_example2}\n" \
           f"输入列表：{for_score_tags2}\n" \
           f"输出：{for_score_dict2}\n" \
           f"输入文本：{for_score_example3}\n" \
           f"输入列表：{for_score_tags3}\n" \
           f"输出：{for_score_dict3}\n" \
           f"接下来轮到你：\n" \
           f"输入文本：{input_text}\n" \
           f"输入列表：{input_list}\n" \
           f"输出："
